app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
SELECT *
FROM `mahasiswa`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
SELECT *
FROM `mahasiswa`
 LIMIT 5, 5
---
    public function index()
    {
        session();
        helper('form');

        $this->mhs = new ModelMahasiswa();

        $page = $this->request->getVar('page_mahasiswa') ? $this->request->getVar('page_mahasiswa') : 1;
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $mhs = $this->mhs->search($keyword);
        } else {
            session()->setFlashdata('fail_search', 'Gagal mencari data mahasiswa');
            $mhs = $this->mhs;
        }

        $data = [
            'title'     => 'Dashboard | Admin',
            'tampil'    => 'viewdatamahasiswa',
            'validation' => \Config\Services::validation(),
            'mahasiswa' => json_decode(json_encode($mhs->paginate(5, 'mahasiswa')), FALSE), //Ngubah data dari modelmahasiswa(array) ke object
            'pager'     => $mhs->pager,
            'page' => $page,
            'keyword' => $keyword,
        ];