app/Models/ModelMahasiswa.php

    function TampilData()
    {
        return $this->db->table('mahasiswa')->get();
---
SELECT *
FROM `mahasiswa`

    public function HapusData($id)
    {
        return $this->db->table('mahasiswa')->delete(['id_mhs' => $id]);
---
DELETE FROM `mahasiswa`
WHERE `id_mhs` = ''

    public function EditData($data, $id)
    {
        return $this->db->table('mahasiswa')->update($data, ['id_mhs' => $id]);
---
UPDATE `mahasiswa` SET `nama_mhs` = 'Tes', `TmpLahir_mhs` = 'Bentar', `TglLahir_mhs` = '2003-12-13', `alamat_mhs` = 'An Aja  ya', `hp_mhs` = '2020202', `jurusan_mhs` = 'Kak'
WHERE `id_mhs` = '1'